## Question 1: Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.
---

In [2]:
import pandas as pd 
a=pd.Series([4,8,15,16,23,42])
print(a)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

## Question 2: Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.
---

In [3]:
b=[1,2,3,4,5,6,7,8,9,10]
c=pd.Series(b)
print(c)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

## Question 3: Create a Pandas DataFrame that contains the following data:

|Name  |Age  |Gender|
|:----:|:---:|:----:|
|Alice |25   |Female|
|Bob   |30   |Male  |
|Claire|27   |Female|

## Then Print the DataFrame

---

In [4]:
x={"Name":["Alice","Bob","Claire"],
  "Age":[25 , 30 , 27] ,
  "Gender":["Female","Male","Female"]}

df=pd.DataFrame(x)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [5]:
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

## Question 4: What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
---

n Pandas, a DataFrame is a two-dimensional labeled data structure with columns of potentially different types, similar to a spreadsheet or SQL table. It is a fundamental Pandas object used for data manipulation, analysis, and visualization. It is a collection of Pandas series, where each series represents a column of data.

On the other hand, a Series is a one-dimensional labeled array that can hold data of any type. It can be thought of as a column in a table or a single variable. A DataFrame can be seen as a collection of Series objects, where each column of the DataFrame is a Series.

In summary, a DataFrame is a two-dimensional table-like data structure with columns and rows, where each column can be of different data types, and a Series is a one-dimensional labeled array with homogeneous data type. A DataFrame is a collection of Series objects, where each column of the DataFrame is a Series.

In [6]:
# dataframe

df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [8]:
type(df)

pandas.core.frame.DataFrame

In [7]:
df['Name']

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

In [9]:
type(df['Name'])

pandas.core.series.Series

## Question 5: What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?
---

There are many functions available in Pandas for manipulating data in a DataFrame. Here are some of the most common ones:

head() and tail(): These functions allow you to view the first or last n rows of the DataFrame, respectively. For example, df.head(10) would show the first 10 rows of the DataFrame.

info(): This function provides information about the DataFrame, including the data types of each column and the number of non-null values. For example, df.info() would show information about the DataFrame.

describe(): This function generates descriptive statistics for the DataFrame, including count, mean, standard deviation, minimum, and maximum values. For example, df.describe() would show descriptive statistics for the DataFrame.

drop(): This function allows you to drop one or more columns or rows from the DataFrame. For example, df.drop('column_name', axis=1) would drop the specified column from the DataFrame.

groupby(): This function groups the DataFrame by one or more columns and allows you to perform operations on each group. For example, df.groupby('column_name').sum() would group the DataFrame by the specified column and calculate the sum of each group.

sort_values(): This function allows you to sort the DataFrame by one or more columns. For example, df.sort_values('column_name') would sort the DataFrame by the specified column.

fillna(): This function allows you to replace missing values in the DataFrame with a specified value. For example, df.fillna(0) would replace all missing values in the DataFrame with 0.

One example of when you might use these functions is when you are analyzing sales data for a company. You could use head() to quickly view the first few rows of the DataFrame to get an idea of what the data looks like. You could use groupby() to group the data by region and calculate the total sales for each region. You could use sort_values() to sort the data by date to see how sales have changed over time. And you could use fillna() to replace any missing values in the data with zeros so that you can perform calculations on the data without errors.

## Question 6: Which of the following is mutable in nature Series, DataFrame, Panel?
---

Both Series and DataFrame are mutable in nature, while Panel is not. This means that you can modify the data in a Series or DataFrame after it has been created, but you cannot modify the data in a Panel after it has been created.

## Question 7 : Create a DataFrame using multiple Series. Explain with an example.
---

To create a DataFrame using multiple Series, we can pass a dictionary of Series to the pd.DataFrame() function. Each key in the dictionary will become a column name in the DataFrame, and each value will become a Series in that column.

Here is an example:

In [10]:
name=pd.Series(['Alice' , 'Bob' , 'Claire'])
age=pd.Series([25,30,22])
gender=pd.Series(['Female','Male','Female'])

d={'Name':name , 'Age': age , 'Gender':gender}

df1=pd.DataFrame(d)

print(df1)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   22  Female

In [11]:
df1

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   22  Female